<div class="alert alert-block alert-success">
    <h1 align="center">Scikit-Learn Tips</h1>
    <h3 align="center">Tip 01: Random State</h3>
    <h4 align="center"><a href="http://www.iran-machinelearning.ir">Soheil Tehranipour</a></h5>
</div>


Q: Why set a value for "random_state"?

A: Ensures that a "random" process will output the same results every time, which makes your code reproducible (by you and others!)

See example ðŸ‘‡

<img src="https://cdn-coiao.nitrocdn.com/CYHudqJZsSxQpAPzLkHFOkuzFKDpEHGF/assets/static/optimized/rev-f6cb400/wp-content/uploads/2022/05/sklearn-train-test-split_syntax-explanation_v2.png">

In [1]:
import sklearn
sklearn.__version__

'0.24.2'

In [1]:
import pandas as pd
df = pd.read_csv(r'C:\Users\soso\Desktop\Maktbakhoone\Scikit-Learn Tips\data.csv')

In [2]:
cols = ['Fare', 'Embarked', 'Sex']
X = df[cols]
y = df['Survived']

In [3]:
from sklearn.model_selection import train_test_split

In [4]:
X

        Fare Embarked     Sex
0     7.2500        S    male
1    71.2833        C  female
2     7.9250        S  female
3    53.1000        S  female
4     8.0500        S    male
..       ...      ...     ...
886  13.0000        S    male
887  30.0000        S  female
888  23.4500        S  female
889  30.0000        C    male
890   7.7500        Q    male

[891 rows x 3 columns]

In [10]:
# any positive integer can be used for the random_state value
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.5, random_state=1)
X_train.head()

         Fare Embarked     Sex
394   16.7000        S  female
851    7.7750        S    male
373  135.6333        C    male
523   57.9792        C  female
78    29.0000        S    male

In [9]:
# using the SAME random_state value results in the SAME random split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.5, random_state=1)
X_train.head()

         Fare Embarked     Sex
394   16.7000        S  female
851    7.7750        S    male
373  135.6333        C    male
523   57.9792        C  female
78    29.0000        S    male

In [8]:
# using a DIFFERENT random_state value results in a DIFFERENT random split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.5, random_state=2)
X_train.head()

         Fare Embarked     Sex
716  227.5250        C  female
154    7.3125        S    male
843    6.4375        C    male
24    21.0750        S  female
294    7.8958        S    male

<img src="https://webna.ir/wp-content/uploads/2018/08/%D9%85%DA%A9%D8%AA%D8%A8-%D8%AE%D9%88%D9%86%D9%87.png" width=50% />